matiasvinas/esp32c3-gateway/main/main.c
    ESP_LOGI(TAG, "BLE Mesh sensor client initialized");

    return ESP_OK;
}

static void log_error_if_nonzero(const char *message, int error_code)
{
    if (error_code != 0) {
        ESP_LOGE(TAG, "Last error %s: 0x%x", message, error_code);
    }
}

/* Event handler registered to receive MQTT events
 * This function is called by the MQTT client event loop. */
 
static void mqtt_event_handler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data)
{
    ESP_LOGD(TAG, "Event dispatched from event loop base=%s, event_id=%" PRIi32 "", base, event_id);
    esp_mqtt_event_handle_t event = event_data;
//    esp_mqtt_client_handle_t client = event->client;
//    int msg_id;
    switch ((esp_mqtt_event_id_t)event_id) {
    case MQTT_EVENT_CONNECTED:
        ESP_LOGI(TAG, "MQTT_EVENT_CONNECTED");
//        ESP_LOGI(TAG, "Wating 10 seconds after connection");
//        vTaskDelay(15000 / portTICK_PERIOD_MS);
//        ESP_LOGI(TAG, "Time expired");
//        msg_id = esp_mqtt_client_publish(client, "master/client123/writeattributevalue/writeAttribute/6bFMXacrKNdld0sY87gBCF", "1", 0, 1, 0);
//        ESP_LOGI(TAG, "my sent publish successful, msg_id=%d", msg_id);
        //msg_id = esp_mqtt_client_subscribe(client, "/topic/qos0", 0);
        //ESP_LOGI(TAG, "sent subscribe successful, msg_id=%d", msg_id);
        break;
        
    case MQTT_EVENT_DISCONNECTED:
        ESP_LOGI(TAG, "MQTT_EVENT_DISCONNECTED");
        break;

    case MQTT_EVENT_SUBSCRIBED:
        ESP_LOGI(TAG, "MQTT_EVENT_SUBSCRIBED, msg_id=%d", event->msg_id);
//        msg_id = esp_mqtt_client_publish(client, "/topic/qos0", "data", 0, 0, 0);
//        ESP_LOGI(TAG, "sent publish successful, msg_id=%d", msg_id);
        break;
        
    case MQTT_EVENT_UNSUBSCRIBED:
        ESP_LOGI(TAG, "MQTT_EVENT_UNSUBSCRIBED, msg_id=%d", event->msg_id);
        break;
        
    case MQTT_EVENT_PUBLISHED:
        ESP_LOGI(TAG, "MQTT_EVENT_PUBLISHED, msg_id=%d", event->msg_id);
        break;
        
    case MQTT_EVENT_DATA:
        ESP_LOGI(TAG, "MQTT_EVENT_DATA");
//        printf("TOPIC=%.*s\r\n", event->topic_len, event->topic);
//        printf("DATA=%.*s\r\n", event->data_len, event->data);
        break;
        
    case MQTT_EVENT_ERROR:
        ESP_LOGI(TAG, "MQTT_EVENT_ERROR");
        if (event->error_handle->error_type == MQTT_ERROR_TYPE_TCP_TRANSPORT) {
            log_error_if_nonzero("reported from esp-tls", event->error_handle->esp_tls_last_esp_err);
            log_error_if_nonzero("reported from tls stack", event->error_handle->esp_tls_stack_err);
            log_error_if_nonzero("captured as transport's socket errno",  event->error_handle->esp_transport_sock_errno);
            ESP_LOGI(TAG, "Last errno string (%s)", strerror(event->error_handle->esp_transport_sock_errno));
        }
        break;
        
    default:
        ESP_LOGI(TAG, "Other event id:%d", event->event_id);
        break;
    }
}


esp_mqtt_client_config_t mqtt_cfg = {
    .broker.address.uri = "mqtt://192.168.1.10:1883",
    .credentials.client_id = "client123",
    .credentials.authentication.password = "HbOvli0ynU6q2oWOLltK7ece0GS8b22A",
    .credentials.username = "master:mqttuser"
};
        
    

void app_main(void)
{
    esp_err_t err = ESP_OK;

    ESP_LOGI(TAG, "Initializing...");

    err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);

    err = bluetooth_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp32_bluetooth_init failed (err %d)", err);
        return;
    }

    ble_mesh_get_dev_uuid(dev_uuid);

    /* Initialize the Bluetooth Mesh Subsystem */
    err = ble_mesh_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Bluetooth mesh init failed (err %d)", err);
    }
    
    ESP_ERROR_CHECK(nvs_flash_init());
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    /* WIFI - Configuration */
    ESP_ERROR_CHECK(example_connect());

	esp_mqtt_client_handle_t client = esp_mqtt_client_init(&mqtt_cfg);
	/* The last argument may be used to pass data to the event handler */
    esp_mqtt_client_register_event(client, ESP_EVENT_ANY_ID, mqtt_event_handler, NULL);
    esp_mqtt_client_start(client);

	while(1)
	{
		ESP_LOGI("LOOP", "Sending GET Message to Sensors...");
        vTaskDelay(5000 / portTICK_PERIOD_MS);
		example_ble_mesh_send_sensor_message(ESP_BLE_MESH_MODEL_OP_SENSOR_GET);
		
		ESP_LOGI("LOOP", "TEMPERATURE DATA: %f", nodes[0].temp_state);
		ESP_LOGI("LOOP", "HUMIDITY DATA: %f", nodes[0].moisture_state);

		vTaskDelay(5000 / portTICK_PERIOD_MS);
        ESP_LOGI("LOOP", "Publishing temperature values to MQTT Broker...");
        char str_temperature[10];
        sprintf(str_temperature, "%f", nodes[0].temp_state);
        esp_mqtt_client_publish(client, "master/client123/writeattributevalue/temperature/40rk67EDRU27UNN5QJbA6N", "2", 0, 1, 0);

		vTaskDelay(5000 / portTICK_PERIOD_MS);
        ESP_LOGI("LOOP", "Publishing humidity values to MQTT Broker...");
        char str_humidity[10];
        sprintf(str_humidity, "%f", nodes[0].temp_state);
        esp_mqtt_client_publish(client, "master/client123/writeattributevalue/humidity/40rk67EDRU27UNN5QJbA6N", str_humidity, 0, 1, 0);
       
	}  
}
